## NAME   : DEEPAK
## ROLL NO: 205229106

## LAB -12

## Question1.   Perform   CRUD   operations   on   Student   Table   as   outlined   in   the   reference

https://medium.com/analytics-vidhya/programming-with-databases-in-python-using-sqlite-4cecbef51ab9

In [2]:
import sqlite3
conn = sqlite3.connect('my_database.sqlite')
cursor = conn.cursor()
print("Opened database successfully")

Opened database successfully

## Creating a Table

In [4]:
cursor.execute('''CREATE TABLE SCHOOL
         (ID INT PRIMARY KEY     NOT NULL,
         NAME           TEXT    NOT NULL,
         AGE            INT     NOT NULL,
         ADDRESS        CHAR(50),
         MARKS          INT);''')
cursor.close()

In [7]:
import sqlite3
conn = sqlite3.connect('my_database.sqlite')
cursor = conn.cursor()

cursor.execute("INSERT INTO SCHOOL (ID,NAME,AGE,ADDRESS,MARKS) \
      VALUES (1, 'Rohan', 14, 'Delhi', 200)");
cursor.execute("INSERT INTO SCHOOL (ID,NAME,AGE,ADDRESS,MARKS) \
      VALUES (2, 'Allen', 14, 'Bangalore', 150 )");
cursor.execute("INSERT INTO SCHOOL (ID,NAME,AGE,ADDRESS,MARKS) \
      VALUES (3, 'Martha', 15, 'Hyderabad', 200 )");
cursor.execute("INSERT INTO SCHOOL (ID,NAME,AGE,ADDRESS,MARKS) \
      VALUES (4, 'Palak', 15, 'Kolkata', 650)");conn.commit()
conn.close()

## SELECTING records from the TABLE

In [9]:
import sqlite3
conn = sqlite3.connect('my_database.sqlite')
cursor = conn.cursor()
for row in cursor.execute("SELECT id, name, marks from SCHOOL"):
    print("ID = ", row[0])
    print("NAME = ", row[1])
    print("MARKS = ", row[2], "\n")
    
conn.commit()
conn.close()

ID =  1
NAME =  Rohan
MARKS =  200

ID =  2
NAME =  Allen
MARKS =  150

ID =  3
NAME =  Martha
MARKS =  200

ID =  4
NAME =  Palak
MARKS =  650

## UPDATING Records in the TABLE

In [10]:
import sqlite3
conn = sqlite3.connect('my_database.sqlite')
cursor = conn.cursor()
conn.execute("UPDATE SCHOOL set MARKS = 250 where ID = 3")
conn.commit()

for row in cursor.execute("SELECT id, name, address, marks from SCHOOL"):
   print("ID = ", row[0])
   print("NAME = ", row[1])
   print("MARKS = ", row[2], "\n")

conn.commit()
conn.close()

ID =  1
NAME =  Rohan
MARKS =  Delhi

ID =  2
NAME =  Allen
MARKS =  Bangalore

ID =  3
NAME =  Martha
MARKS =  Hyderabad

ID =  4
NAME =  Palak
MARKS =  Kolkata

## DELETE Operation

In [14]:
import sqlite3
conn = sqlite3.connect('my_database.sqlite')
cursor = conn.cursor()
conn.execute("DELETE from  SCHOOL where ID = 2")
conn.commit()

for row in cursor.execute("SELECT id, name, address, marks from SCHOOL"):
   print("ID = ", row[0])
   print("NAME = ", row[1])
   print("ADDRESS = ", row[2])   
   print("MARKS = ", row[3], "\n")

conn.commit()
conn.close()

ID =  1
NAME =  Rohan
ADDRESS =  Delhi
MARKS =  200

ID =  3
NAME =  Martha
ADDRESS =  Hyderabad
MARKS =  250

ID =  4
NAME =  Palak
ADDRESS =  Kolkata
MARKS =  650

## Question2. Open the table MyRestaurants.db that you have created for NoSQL course

In [52]:
import cx_Oracle
conn = cx_Oracle.connect( "scott/scott")
sql = "SELECT * FROM MY_RES "
cursor = conn.cursor()
cursor.execute(sql)
for row in cursor.execute("SELECT * from MY_RES"):
    print("NAME = ", row[0])
    print("FOODTYPE=",row[1])       
    print("DISTANCE=" ,row[2])      
    print("LASTVISIT=",row[3])      
    print("ILIKE=",row[4])
    print("\n")
    
conn.commit()
conn.close()

NAME =  dosacorner
FOODTYPE= nonveg
DISTANCE= 10
LASTVISIT= 05-feb-2020
ILIKE= 1


NAME =  apple_leaf
FOODTYPE= nonveg
DISTANCE= 15
LASTVISIT= 01-jan-2020
ILIKE= 1


NAME =  sowmyas
FOODTYPE= veg
DISTANCE= 18
LASTVISIT= 20-mar-2020
ILIKE= 1


NAME =  thinnappa
FOODTYPE= nonveg
DISTANCE= 25
LASTVISIT= 20-nov-2019
ILIKE= 0


NAME =  sribhavan
FOODTYPE= veg
DISTANCE= 18
LASTVISIT= 20-dec-2019
ILIKE= 0


NAME =  chinaworld
FOODTYPE= chinese
DISTANCE= 14
LASTVISIT= 05-mar-2020
ILIKE= 1


NAME =  littlechina
FOODTYPE= chinese
DISTANCE= 30
LASTVISIT= 10-mar-2020
ILIKE= 0


NAME =  munivilas
FOODTYPE= nonveg
DISTANCE= 20
LASTVISIT= 05-dec-2019
ILIKE= None

## Question3. Write a SQL query that returns all restaurants in your table MyRestaurants.db.

In [53]:
import cx_Oracle
conn = cx_Oracle.connect( "scott/scott")
sql = "SELECT * FROM MY_RES "
cursor = conn.cursor()
cursor.execute(sql)
for row in cursor.execute("SELECT NAME from MY_RES"):
    print("NAME = ", row[0])
conn.commit()
conn.close()

NAME =  dosacorner
NAME =  apple_leaf
NAME =  sowmyas
NAME =  thinnappa
NAME =  sribhavan
NAME =  chinaworld
NAME =  littlechina
NAME =  munivilas

## Question4. Write a SQL query that returns the names of restaurants in descending order that makes Chinese foods.

In [54]:
import cx_Oracle
conn = cx_Oracle.connect( "scott/scott")
sql = "SELECT * FROM MY_RES "
cursor = conn.cursor()
cursor.execute(sql)
for row in cursor.execute("SELECT NAME, FOODTYPE from MY_RES WHERE FOODTYPE = 'chinese' GROUP BY NAME, FOODTYPE ORDER BY NAME, FOODTYPE DESC"):
    print("NAME = ", row[0])
    print("FOODTYPE= ", row[1])
    print("\n")
conn.commit()
conn.close()

NAME =  chinaworld
FOODTYPE=  chinese


NAME =  littlechina
FOODTYPE=  chinese